<?php

return [
	// الاستثناءات
	'invalidModel'        => 'يجب تحميل النموذج {0} قبل الاستخدام.',
	'userNotFound'        => 'تعذر العثور على مستخدم برقم التعريف = {0}.',
	'noUserEntity'        => 'يجب توفير كيان المستخدم للتحقق من كلمة المرور.',
	'tooManyCredentials'  => 'يمكنك التحقق فقط من اعتماد واحد غير كلمة المرور.',
	'invalidFields'       => 'تعذر استخدام الحقل "{0}" للتحقق من الاعتمادات.',
	'unsetPasswordLength' => 'يجب تعيين إعداد `minimumPasswordLength` في ملف تكوين Auth.',
	'unknownError'        => 'عذرًا، واجهنا مشكلة في إرسال البريد الإلكتروني إليك. يرجى المحاولة مرة أخرى في وقت لاحق.',
	'notLoggedIn'         => 'يجب تسجيل الدخول للوصول إلى تلك الصفحة.',
	'notEnoughPrivilege'  => 'ليس لديك صلاحيات كافية للوصول إلى تلك الصفحة.',

	// التسجيل
	'registerDisabled' => 'عذرًا، لا يُسمح حاليًا بحسابات المستخدمين الجدد.',
	'registerSuccess'  => 'مرحبًا بك! يرجى تسجيل الدخول باستخدام بيانات اعتمادك الجديدة.',
	'registerCLI'      => 'تم إنشاء مستخدم جديد: {0}، #{1}',

	// التنشيط
	'activationNoUser'       => 'تعذر العثور على مستخدم بهذا الرمز التنشيط.',
	'activationSubject'      => 'قم بتنشيط حسابك',
	'activationSuccess'      => 'يرجى تأكيد حسابك عن طريق النقر على رابط التنشيط في البريد الإلكتروني الذي أرسلناه.',
	'activationResend'       => 'إعادة إرسال رسالة التنشيط مرة أخرى.',
	'notVerified'            => 'هذا الحساب لم يتم التحقق منه بعد.',
	'notActivated'           => 'هذا الحساب لم يتم تنشيطه بعد.',
	'errorSendingActivation' => 'فشل في إرسال رسالة التنشيط إلى: {0}',

	// تسجيل الدخول
    'badAttempt'      => 'تعذر تسجيل الدخول. يرجى التحقق من بيانات اعتمادك.',
    'loginSuccess'    => 'مرحبًا مجددًا!',
    'invalidPassword' => 'تعذر تسجيل الدخول. يرجى التحقق من كلمة المرور.',

    // نسيان كلمات المرور
    'forgotDisabled'  => 'تم تعطيل خيار إعادة تعيين كلمة المرور.',
    'forgotNoUser'    => 'تعذر العثور على مستخدم بهذا البريد الإلكتروني.',
    'forgotSubject'   => 'تعليمات إعادة تعيين كلمة المرور',
    'resetSuccess'    => 'تم تغيير كلمة المرور بنجاح. يرجى تسجيل الدخول باستخدام كلمة المرور الجديدة.',
    'forgotEmailSent' => 'تم إرسال رمز أمان إلى بريدك الإلكتروني. أدخله في الخانة أدناه للمتابعة.',
    'errorEmailSent'  => 'تعذر إرسال بريد إلكتروني بتعليمات إعادة تعيين كلمة المرور إلى: {0}',
    'errorResetting'  => 'تعذر إرسال تعليمات إعادة تعيين إلى {0}',

    // كلمات المرور
    'errorPasswordLength'         => 'يجب أن تكون كلمات المرور على الأقل {0} أحرف.',
    'suggestPasswordLength'       => 'العبارات السرية - تصل إلى 255 حرفًا - تجعل كلمات المرور أكثر أمانًا وسهولة تذكرها.',
    'errorPasswordCommon'         => 'يجب ألا تكون كلمة المرور شائعة.',
    'suggestPasswordCommon'       => 'تم فحص كلمة المرور ضد أكثر من 65 ألف كلمة مرور شائعة أو كلمات مرور تم تسريبها من خلال اختراقات.',
    'errorPasswordPersonal'       => 'لا يمكن أن تحتوي كلمات المرور على معلومات شخصية مُعادة.',
    'suggestPasswordPersonal'     => 'لا ينبغي استخدام الإصدارات عن عنوان بريدك الإلكتروني أو اسم المستخدم في كلمات المرور.',
    'errorPasswordTooSimilar'     => 'كلمة المرور مشابهة لاسم المستخدم جدًا.',
    'suggestPasswordTooSimilar'   => 'لا تستخدم أجزاء من اسم المستخدم في كلمة المرور.',
    'errorPasswordPwned'          => 'تم تعريض كلمة المرور {0} بسبب اختراق للبيانات وقد رآها {1} مرة في {2} من كلمات المرور التالفة.',
    'suggestPasswordPwned'        => '{0} يجب ألا يُستخدم أبدًا ككلمة مرور. إذا كنت تستخدمه في أي مكان، قُم بتغييره على الفور.',
    'errorPasswordPwnedDatabase'  => 'قاعدة بيانات',
    'errorPasswordPwnedDatabases' => 'قواعد البيانات',
    'errorPasswordEmpty'          => 'كلمة المرور مطلوبة.',
    'passwordChangeSuccess'       => 'تم تغيير كلمة المرور بنجاح',
    'userDoesNotExist'            => 'لم يتم تغيير كلمة المرور. المستخدم غير موجود',
    'resetTokenExpired'           => 'عذرًا. انتهى صلاحية رمز إعادة التعيين الخاص بك.',

	// المجموعات
    'groupNotFound' => 'تعذر العثور على المجموعة: {0}.',

    // الأذونات
    'permissionNotFound' => 'تعذر العثور على الإذن: {0}',

    // المحظورين
    'userIsBanned' => 'تم حظر المستخدم. تواصل مع المسؤول',

    // الكثير من الطلبات
    'tooManyRequests' => 'الكثير من الطلبات. يرجى الانتظار {0, number} ثانية.',

    // عروض تسجيل الدخول
    'home'                      => 'الصفحة الرئيسية',
    'current'                   => 'الحالي',
    'forgotPassword'            => 'هل نسيت كلمة المرور؟',
    'enterEmailForInstructions' => 'لا مشكلة! أدخل بريدك الإلكتروني أدناه وسنرسل تعليمات لإعادة تعيين كلمة المرور.',
    'email'                     => 'البريد الإلكتروني',
    'emailAddress'              => 'عنوان البريد الإلكتروني',
    'sendInstructions'          => 'إرسال التعليمات',
    'loginTitle'                => 'تسجيل الدخول',
    'loginAction'               => 'تسجيل الدخول',
    'rememberMe'                => 'تذكرني',
    'needAnAccount'             => 'هل تحتاج إلى حساب؟',
    'forgotYourPassword'        => 'هل نسيت كلمة المرور؟',
    'password'                  => 'كلمة المرور',
    'repeatPassword'            => 'تأكيد كلمة المرور',
    'emailOrUsername'           => 'البريد الإلكتروني أو اسم المستخدم',
    'username'                  => 'اسم المستخدم',
    'register'                  => 'التسجيل',
    'signIn'                    => 'تسجيل الدخول',
    'alreadyRegistered'         => 'هل أنت مسجل بالفعل؟',
    'weNeverShare'              => 'لن نشارك بريدك الإلكتروني مع أي شخص آخر.',
    'resetYourPassword'         => 'إعادة تعيين كلمة المرور',
    'enterCodeEmailPassword'    => 'أدخل الرمز الذي تلقيته عبر البريد الإلكتروني، عنوان بريدك الإلكتروني، وكلمة المرور الجديدة.',
    'token'                     => 'الرمز',
    'newPassword'               => 'كلمة المرور الجديدة',
    'newPasswordRepeat'         => 'تأكيد كلمة المرور الجديدة',
    'resetPassword'             => 'إعادة تعيين كلمة المرور',
];
